Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_US_MR" edc:nzwidth="0x20" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xF7FFFFFF" edc:_addr="0x40010204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:nzwidth="0x4" edc:desc="USART Mode of Operation">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:nzwidth="0x2" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV=8) is selected." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PCK" edc:desc="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Serial clock (SCK) is selected." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:nzwidth="0x2" edc:desc="Character Length">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:nzwidth="0x1" edc:desc="Synchronous Mode Select"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:nzwidth="0x3" edc:desc="Parity Type">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:nzwidth="0x2" edc:desc="Number of Stop Bits">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:nzwidth="0x2" edc:desc="Channel Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBF" edc:nzwidth="0x1" edc:desc="Bit Order"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:nzwidth="0x1" edc:desc="9-bit Character Length"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:nzwidth="0x1" edc:desc="Clock Output Select"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:nzwidth="0x1" edc:desc="Oversampling Mode"/>
            <edc:SFRFieldDef edc:cname="OOKRXD" edc:nzwidth="0x1" edc:desc="OOK Demodulation Input Selection"/>
            <edc:SFRFieldDef edc:cname="OOKEN" edc:nzwidth="0x1" edc:desc="OOK Modulation/Demodulation Enabled"/>
            <edc:SFRFieldDef edc:cname="VAR_SYNC" edc:nzwidth="0x1" edc:desc="Variable Synchronization of Command/Data Sync Start Frame Delimiter"/>
            <edc:SFRFieldDef edc:cname="INVDATA" edc:nzwidth="0x1" edc:desc="Inverted Data"/>
            <edc:SFRFieldDef edc:cname="MAX_ITERATION" edc:nzwidth="0x3" edc:desc="Maximum Number of Automatic Iteration"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x1" edc:desc="Receive Line Filter"/>
            <edc:SFRFieldDef edc:cname="MAN" edc:nzwidth="0x1" edc:desc="Manchester Encoder/Decoder Enable"/>
            <edc:SFRFieldDef edc:cname="MODSYNC" edc:nzwidth="0x1" edc:desc="Manchester Synchronization Mode"/>
            <edc:SFRFieldDef edc:cname="ONEBIT" edc:nzwidth="0x1" edc:desc="Start Frame Delimiter Selector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_US_IER" edc:nzwidth="0x20" edc:access="wwwwwwww-w--w---wwwwwwwwwwwwwwww" edc:impl="0xFF48FFFF" edc:_addr="0x40010208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Max number of Repetitions Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear to Send Input Change Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:nzwidth="0x1" edc:desc="Manchester Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINBE" edc:nzwidth="0x1" edc:desc="LIN Bus Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINISFE" edc:nzwidth="0x1" edc:desc="LIN Inconsistent Synch Field Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINIPE" edc:nzwidth="0x1" edc:desc="LIN Identifier Parity Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINCE" edc:nzwidth="0x1" edc:desc="LIN Checksum Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Client Not Responding Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
