Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_TWI_CWGR" edc:nzwidth="0x20" edc:access="--nnnnnn---n-nnnnnnnnnnnnnnnnnnn" edc:impl="0x3F17FFFF" edc:_addr="0x40010610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:nzwidth="0x8" edc:desc="Clock Low Divider"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:nzwidth="0x8" edc:desc="Clock High Divider"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:nzwidth="0x3" edc:desc="Clock Divider"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:nzwidth="0x1" edc:desc="Bit Rate Source Clock">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:nzwidth="0x6" edc:desc="TWD Hold Time Versus TWCK Falling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40010614"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_TWI_SR" edc:nzwidth="0x20" edc:access="-----rrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x7BFFFFF" edc:_addr="0x40010620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed (cleared by writing FLEX_TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:nzwidth="0x1" edc:desc="Client Read"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledged (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:nzwidth="0x1" edc:desc="Clock Wait State"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBAF" edc:nzwidth="0x1" edc:desc="SMBus Alert Flag"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXFLOCK" edc:nzwidth="0x1" edc:desc="Transmit FIFO Lock"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:nzwidth="0x1" edc:desc="SCL Line Value"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:nzwidth="0x1" edc:desc="SDA Line Value"/>
            <edc:SFRFieldDef edc:cname="SR" edc:nzwidth="0x1" edc:desc="Start Repeated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM4" edc:cname="FLEX_TWI_IER" edc:nzwidth="0x20" edc:access="----------wwww-wwwwwwwwwwwww-www" edc:impl="0x3DFFF7" edc:_addr="0x40010624">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM4">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
