Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IER" edc:nzwidth="0x20" edc:access="---wwwww----ww-----------wwwwwww" edc:impl="0x1F0C007F" edc:_addr="0x40024024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXCHUNK" edc:nzwidth="0x1" edc:desc="Receive FIFO Chunk Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Under Flow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0x1" edc:desc="Receive Over Flow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SMEV" edc:nzwidth="0x1" edc:desc="Supply Monitor Event Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EOS" edc:nzwidth="0x1" edc:desc="End Of Sequence Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IDR" edc:nzwidth="0x20" edc:access="---wwwww----ww-----------wwwwwww" edc:impl="0x1F0C007F" edc:_addr="0x40024028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXCHUNK" edc:nzwidth="0x1" edc:desc="Receive FIFO Chunk Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Under Flow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0x1" edc:desc="Receive Over Flow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SMEV" edc:nzwidth="0x1" edc:desc="Supply Monitor Event Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EOS" edc:nzwidth="0x1" edc:desc="End Of Sequence Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IMR" edc:nzwidth="0x20" edc:access="---rrrrr----rr-----------rrrrrrr" edc:impl="0x1F0C007F" edc:_addr="0x4002402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXCHUNK" edc:nzwidth="0x1" edc:desc="Receive FIFO Chunk Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Under Flow Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0x1" edc:desc="Receive Over Flow Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SMEV" edc:nzwidth="0x1" edc:desc="Supply Monitor Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EOS" edc:nzwidth="0x1" edc:desc="End Of Sequence Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_ISR" edc:nzwidth="0x20" edc:access="---rrrrr----rr-----------rrrrrrr" edc:impl="0x1F0C007F" edc:_addr="0x40024030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXCHUNK" edc:nzwidth="0x1" edc:desc="Receive FIFO Chunk (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Under Flow (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:nzwidth="0x1" edc:desc="Receive Over Flow (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMEV" edc:nzwidth="0x1" edc:desc="Supply Monitor Event (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EOS" edc:nzwidth="0x1" edc:desc="End Of Sequence (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EOC_IER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40024034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EOC_IDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40024038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EOC_IMR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4002403C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
