Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_IPR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4002C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_IECR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4002C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_IDCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4002C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4002C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_ISR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4002C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
