Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_SMMR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x48008048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="GCEN" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:SFRFieldDef edc:cname="DOWN" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4800804C"/>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_CV" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48008050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_RA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48008054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x20" edc:desc="Register A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_RB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48008058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="RB" edc:nzwidth="0x20" edc:desc="Register B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_RC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4800805C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="RC" edc:nzwidth="0x20" edc:desc="Register C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_SR" edc:nzwidth="0x20" edc:access="-------------rrr-----rrrrrrrrrrr" edc:impl="0x707FF" edc:_addr="0x48008060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:nzwidth="0x1" edc:desc="Clock Enabling Status"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:nzwidth="0x1" edc:desc="TIOAx Mirror"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:nzwidth="0x1" edc:desc="TIOBx Mirror"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_IER" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x48008064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_IDR" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x48008068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_IMR" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:impl="0x7FF" edc:_addr="0x4800806C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC3" edc:cname="TC_CHANNEL1TC3_EMR" edc:nzwidth="0x20" edc:access="-----------------------n--nn--nn" edc:impl="0x133" edc:_addr="0x48008070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="TRIGSRCA" edc:nzwidth="0x2" edc:desc="Trigger Source for Input A">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOAx" edc:desc="The trigger/capture input A is driven by external pin TIOAx" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="The trigger/capture input A is driven internally by PWMx" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRIGSRCB" edc:nzwidth="0x2" edc:desc="Trigger Source for Input B">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOBx" edc:desc="The trigger/capture input B is driven by external pin TIOBx" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx." edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NODIVCLK" edc:nzwidth="0x1" edc:desc="No Divided Clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
