Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_IECR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4801400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_IDCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x48014010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48014014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_ISR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48014018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Current Interrupt Identifier"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------n-" edc:impl="0xFFFFFF02" edc:_addr="0x4801401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x495043"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FE0" edc:_addr="0x48014020"/>
      <edc:SFRDef ltx:memberofperipheral="MCSPI" edc:cname="MCSPI_CR" edc:nzwidth="0x20" edc:access="ww-----w------ww---w----w-----ww" edc:impl="0xC1031083" edc:_addr="0x48018000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCSPI">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:nzwidth="0x1" edc:desc="MCSPI Enable"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:nzwidth="0x1" edc:desc="MCSPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="MCSPI Software Reset"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:nzwidth="0x1" edc:desc="Request to Clear the Comparison Trigger"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXFCLR" edc:nzwidth="0x1" edc:desc="Transmit FIFO Clear"/>
            <edc:SFRFieldDef edc:cname="RXFCLR" edc:nzwidth="0x1" edc:desc="Receive FIFO Clear"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="FIFO Enable"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:nzwidth="0x1" edc:desc="FIFO Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCSPI" edc:cname="MCSPI_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn----nnnnnnnn--nnnnnnnnnn" edc:impl="0xFF0FF3FF" edc:_addr="0x48018004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCSPI">
            <edc:SFRFieldDef edc:cname="MSTR" edc:nzwidth="0x1" edc:desc="Host/Client Mode"/>
            <edc:SFRFieldDef edc:cname="PS" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:nzwidth="0x1" edc:desc="Chip Select Decode"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:nzwidth="0x1" edc:desc="Bit Rate Source Clock">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:nzwidth="0x1" edc:desc="Mode Fault Detection"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait for Data Read Before Transfer"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:nzwidth="0x1" edc:desc="CRC Enable"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:nzwidth="0x1" edc:desc="Local Loopback Enable"/>
            <edc:SFRFieldDef edc:cname="LSBHALF" edc:nzwidth="0x1" edc:desc="LSB Timing Selection"/>
            <edc:SFRFieldDef edc:cname="TMCSMUX" edc:nzwidth="0x1" edc:desc="Two-pin MOSI Chip Select External Multiplexing Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="External MOSI lines multiplexing is not required via Chip Select lines. When MCSPI_MR.TPMEN=0, MCSPI_TWMR.MIL=1 or MCSPI_TWMR.CSM=0, TMCSMUX must be written to 0." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enables external multiplexing of MOSI lines via Chip Select lines. When MCSPI_MR.TPMEN=1, TMCSMUX must be written to 1 if MCSPI_TWMR.MIL=0 and MCSPI_TWMR.CSM=1." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x1" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TPMEN" edc:nzwidth="0x1" edc:desc="Two-Pin Mode Enable"/>
            <edc:SFRFieldDef edc:cname="CSIE" edc:nzwidth="0x1" edc:desc="Chip Select Inversion Enable"/>
            <edc:SFRFieldDef edc:cname="MOSIIE" edc:nzwidth="0x1" edc:desc="MOSI Inversion Enable"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:nzwidth="0x8" edc:desc="Delay Between Chip Selects"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
