Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX5112MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_MRCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x48020100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8"/>
            <edc:SFRFieldDef edc:cname="RCB9" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 9"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 11"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12"/>
            <edc:SFRFieldDef edc:cname="RCB13" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 13"/>
            <edc:SFRFieldDef edc:cname="RCB14" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 14"/>
            <edc:SFRFieldDef edc:cname="RCB15" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x48020104"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4802011C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4802012C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_SFR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48020130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
